---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireSet.Insert(Autodesk.Revit.DB.Electrical.Wire)
source: html/a0de9817-77e3-0cce-43c7-792a79cfb674.htm
---
# Autodesk.Revit.DB.Electrical.WireSet.Insert Method

## Syntax (C#)
```csharp
public virtual bool Insert(
	Wire item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.Wire`)